src/IskanderHearth/thermal/openfoam/hearth_t2_thermal/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  Iskander Hearth — Tier 2 Chassis Thermal CFD Case
  Solver  : buoyantSimpleFoam (steady-state, buoyancy-driven + forced convection)
  Version : OpenFOAM v2312
  License : CERN-OHL-S v2 / OpenFOAM GPL-3.0
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// ── Solver ────────────────────────────────────────────────────────────────────
// buoyantSimpleFoam: steady-state RANS, buoyancy (natural convection) + forced
// convection (fan-driven airflow). Solves T, U, p_rgh simultaneously.
application     buoyantSimpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;

// 3000 iterations is typically sufficient for Leq < 1e-4 convergence on this mesh.
// Increase to 5000 if residuals have not converged by iteration 3000.
endTime         3000;

deltaT          1;          // Pseudo-time step (SIMPLE: dimensionless)

writeControl    timeStep;
writeInterval   500;        // Write every 500 iterations for checkpoint

purgeWrite      2;          // Keep only 2 time directories (last checkpoint + current)
writeFormat     ascii;
writePrecision  7;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

// ── Function objects ──────────────────────────────────────────────────────────

functions
{
    // Residual convergence monitor — terminate early if all residuals < 1e-4
    residuals
    {
        type            solverInfo;
        libs            ("libutilityFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   50;
        fields          (U p_rgh T k omega);
    }

    // Temperature statistics on key surfaces
    gpu_surface_T
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   100;
        operation       average;
        regionType      patch;
        name            gpu_surface;
        fields          (T);
    }

    cpu_surface_T
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   100;
        operation       average;
        regionType      patch;
        name            cpu_surface;
        fields          (T);
    }

    // Volume-averaged temperature in GPU zone (Y: 0–0.240, Z: 0–0.130)
    // Uses cellZone defined in snappyHexMeshDict
    gpu_zone_T
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   100;
        operation       volAverage;
        regionType      all;
        fields          (T);
    }
}

// ************************************************************************* //
