src/IskanderHearth/thermal/openfoam/hearth_t2_thermal/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  Iskander Hearth — Tier 2 Chassis Thermal CFD
  OpenFOAM v2312 | Base hex mesh for snappyHexMesh refinement

  Domain represents the INTERIOR air volume of the chassis:
    X (width):  0 → 0.324 m  (324mm interior, MB + PSU side by side)
    Y (depth):  0 → 0.270 m  (270mm interior, GPU front-to-back)
    Z (height): 0 → 0.250 m  (250mm interior, floor to ceiling)

  Coordinate convention:
    +X  : from GPU/left side toward PSU/right side
    +Y  : from front panel toward rear panel
    +Z  : from chassis floor upward

  Base cell size ≈ 12mm at level 0.
  snappyHexMeshDict will refine to ~3mm near GPU/CPU surfaces.
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;  // Coordinates already in metres

vertices
(
    // Block 0: full interior volume
    // Bottom face (Z = 0)
    (0.000  0.000  0.000)   // 0
    (0.324  0.000  0.000)   // 1
    (0.324  0.270  0.000)   // 2
    (0.000  0.270  0.000)   // 3
    // Top face (Z = 0.250)
    (0.000  0.000  0.250)   // 4
    (0.324  0.000  0.250)   // 5
    (0.324  0.270  0.250)   // 6
    (0.000  0.270  0.250)   // 7
);

blocks
(
    // hex (vertices) (nx ny nz) grading
    // 324mm / 27 cells = 12mm base cell  (X)
    // 270mm / 22 cells = 12.3mm          (Y)
    // 250mm / 21 cells = 11.9mm          (Z)
    // Total base cells: 27 × 22 × 21 = 12,474
    hex (0 1 2 3 4 5 6 7) (27 22 21) simpleGrading (1 1 1)
);

boundary
(
    // Front panel — intake air enters from front vents
    front_panel
    {
        type    wall;
        faces   ((0 1 5 4));
    }

    // Rear panel — exhaust fan exit
    rear_panel
    {
        type    wall;
        faces   ((3 2 6 7));
    }

    // Left side panel (GPU side)
    left_panel
    {
        type    wall;
        faces   ((0 3 7 4));
    }

    // Right side panel (MB side)
    right_panel
    {
        type    wall;
        faces   ((1 2 6 5));
    }

    // Bottom panel (chassis floor)
    bottom_panel
    {
        type    wall;
        faces   ((0 1 2 3));
    }

    // Top panel (contains intake fan)
    top_panel
    {
        type    wall;
        faces   ((4 5 6 7));
    }
);

// ── Notes for snappyHexMesh refinement ────────────────────────────────────────
// After blockMeshDict, run:
//   blockMesh
//   surfaceFeatureExtract   (extracts features from chassis_interior.stl)
//   snappyHexMesh -overwrite
//
// The snappyHexMeshDict will:
// 1. Castellate: refine near chassis_interior.stl surfaces
// 2. Snap: move surface vertices onto STL geometry
// 3. Add layers: 5 prism layers on GPU/CPU surfaces for y+ ≈ 1 (k-ω SST)
//
// Target y+ for k-ω SST (low-Reynolds): y+ < 1
//   At U_intake = 2.5 m/s, viscosity 1.5e-5 m²/s:
//   First cell height ≈ 0.15mm gives y+ ≈ 0.5 (sufficient)
// ************************************************************************* //
