src/IskanderHearth/thermal/openfoam/hearth_t2_thermal/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  Iskander Hearth — Tier 2 Chassis Thermal CFD
  OpenFOAM v2312 | snappyHexMeshDict

  STL geometry: constant/triSurface/chassis_interior.stl
  Generated from: hearth_chassis_v2.scad → OpenSCAD export → STL
  See: constant/triSurface/README.md for generation procedure

  Named surface regions expected in chassis_interior.stl:
    chassis_walls   — all interior wall faces (adiabatic)
    gpu_surface     — GPU heatsink top surface (85W heat source)
    cpu_surface     — CPU cooler base (25W heat source)
    intake_fan      — Top panel fan circle (velocity inlet)
    exhaust_fan     — Rear panel exhaust fan circle (pressure outlet)
    gpu_vent_slots  — Left panel GPU exhaust vent slots
    front_vents     — Front panel lower intake slots
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    chassis_interior.stl
    {
        type        triSurfaceMesh;
        name        chassis;
        regions
        {
            chassis_walls   { name chassis_walls; }
            gpu_surface     { name gpu_surface; }
            cpu_surface     { name cpu_surface; }
            intake_fan      { name intake_fan; }
            exhaust_fan     { name exhaust_fan; }
            gpu_vent_slots  { name gpu_vent_slots; }
            front_vents     { name front_vents; }
        }
    }

    // Refinement box around GPU for high-resolution thermal field
    gpu_zone_box
    {
        type    searchableBox;
        min     (0.100  0.000  0.003);  // X: GPU side of chassis, Y: front, Z: just above floor
        max     (0.250  0.240  0.130);  // Covers dual-slot GPU footprint
    }

    // Refinement box around CPU/MB
    cpu_zone_box
    {
        type    searchableBox;
        min     (0.180  0.040  0.130);
        max     (0.320  0.210  0.250);
    }
}

castellatedMeshControls
{
    maxLocalCells   1000000;
    maxGlobalCells  5000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 3;

    features
    (
        {
            file    "chassis_interior.eMesh";
            level   2;
        }
    );

    refinementSurfaces
    {
        chassis
        {
            level (1 2);

            regions
            {
                gpu_surface
                {
                    level (3 4);   // Fine resolution on heat source
                    patchInfo { type wall; }
                }
                cpu_surface
                {
                    level (3 4);
                    patchInfo { type wall; }
                }
                intake_fan
                {
                    level (2 3);
                    patchInfo { type patch; }
                }
                exhaust_fan
                {
                    level (2 3);
                    patchInfo { type patch; }
                }
                chassis_walls
                {
                    level (1 2);
                    patchInfo { type wall; }
                }
                gpu_vent_slots
                {
                    level (2 3);
                    patchInfo { type patch; }
                }
                front_vents
                {
                    level (2 3);
                    patchInfo { type patch; }
                }
            }
        }
    }

    refinementRegions
    {
        gpu_zone_box
        {
            mode    inside;
            levels  ((1E15  3));   // Level 3 everywhere inside GPU zone box
        }

        cpu_zone_box
        {
            mode    inside;
            levels  ((1E15  2));
        }
    }

    // Point guaranteed to be inside the air volume (not inside a solid)
    locationInMesh (0.162 0.135 0.125);

    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch        3;
    tolerance           4.0;
    nSolveIter          50;
    nRelaxIter          5;
    nFeatureSnapIter    10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes       true;

    layers
    {
        // 5 prism layers on heat-source surfaces for y+ < 1 (k-ω SST low-Re)
        gpu_surface
        {
            nSurfaceLayers  5;
        }
        cpu_surface
        {
            nSurfaceLayers  5;
        }
        // 3 layers on all other walls
        chassis_walls
        {
            nSurfaceLayers  3;
        }
    }

    expansionRatio      1.3;
    // First layer thickness: target y+ ≈ 0.5 at U = 2.5 m/s
    // y = y+ × ν / u* ≈ 0.5 × 1.5e-5 / 0.2 ≈ 3.75e-5 m ≈ 0.04mm
    // finalLayerThickness relative to local cell size:
    finalLayerThickness     0.3;
    minThickness            0.1;
    nGrow                   0;

    featureAngle            60;
    slipFeatureAngle        30;
    nRelaxIter              5;
    nSmoothSurfaceNormals   1;
    nSmoothNormals          3;
    nSmoothThickness        10;
    maxFaceThicknessRatio   0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle      90;
    nBufferCellsNoExtrude   0;
    nLayerIter              50;
}

meshQualityControls
{
    maxNonOrtho         70;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;
    minVol              1e-13;
    minTetQuality       1e-30;
    minArea             -1;
    minTwist            0.05;
    minDeterminant      0.001;
    minFaceWeight       0.05;
    minVolRatio         0.01;
    minTriangleTwist    -1;
    nSmoothScale        4;
    errorReduction      0.75;
    relaxed
    {
        maxNonOrtho     75;
    }
}

writeFlags
(
    scalarLevels
    scalarEdges
    closedRegionEdges
);

mergeTolerance 1e-6;

// ************************************************************************* //
