src/IskanderHearth/thermal/openfoam/hearth_t2_thermal/constant/g
/*--------------------------------*- C++ -*----------------------------------*\
  Iskander Hearth — Tier 2 Chassis Thermal CFD
  OpenFOAM v2312 | Gravitational acceleration

  Chassis orientation: chassis sits upright on its feet.
  +Z is UP. Gravity therefore points in -Z direction.
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    location    "constant";
    object      g;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions  [0 1 -2 0 0 0 0];

value       (0 0 -9.81);

// ************************************************************************* //
