src/IskanderHearth/thermal/openfoam/hearth_t2_thermal/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  Iskander Hearth — Tier 2 Chassis Thermal CFD
  OpenFOAM v2312 | Specific dissipation rate omega (k-ω SST)

  Inlet omega estimated from mixing length L ≈ 0.07 × D (D = fan diameter = 0.115m)
  L = 0.07 × 0.115 = 0.00805 m
  Cmu = 0.09
  omega = k^0.5 / (Cmu^0.25 × L) = 0.02^0.5 / (0.09^0.25 × 0.00805)
        = 0.1414 / (0.5477 × 0.00805) = 0.1414 / 0.00441 ≈ 32 1/s
  Using 30 1/s as round initial value.
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];   // 1/s

internalField   uniform 30;

boundaryField
{
    intake_fan
    {
        type        fixedValue;
        value       uniform 30;
    }

    exhaust_fan
    {
        type        inletOutlet;
        inletValue  uniform 30;
        value       uniform 30;
    }

    front_vents    { type inletOutlet; inletValue uniform 30; value uniform 30; }
    gpu_vent_slots { type inletOutlet; inletValue uniform 30; value uniform 30; }

    // omegaWallFunction: standard for k-ω SST, handles blending at y+ < 1
    gpu_surface    { type omegaWallFunction; value uniform 30; }
    cpu_surface    { type omegaWallFunction; value uniform 30; }
    chassis_walls  { type omegaWallFunction; value uniform 30; }

    front_panel    { type omegaWallFunction; value uniform 30; }
    rear_panel     { type omegaWallFunction; value uniform 30; }
    left_panel     { type omegaWallFunction; value uniform 30; }
    right_panel    { type omegaWallFunction; value uniform 30; }
    bottom_panel   { type omegaWallFunction; value uniform 30; }
    top_panel      { type omegaWallFunction; value uniform 30; }
}

// ************************************************************************* //
