src/IskanderHearth/thermal/openfoam/hearth_t2_thermal/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  Iskander Hearth — Tier 2 Chassis Thermal CFD
  OpenFOAM v2312 | buoyantSimpleFoam | k-omega SST
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// ── Temporal ──────────────────────────────────────────────────────────────────
// steadyState: required for SIMPLE solver (buoyantSimpleFoam steady mode)
ddtSchemes
{
    default         steadyState;
}

// ── Gradient ──────────────────────────────────────────────────────────────────
// Gauss linear: second-order central differencing — baseline accuracy
// leastSquares for k/omega: more robust on stretched meshes near walls
gradSchemes
{
    default         Gauss linear;
    grad(k)         cellLimited Gauss linear 1;
    grad(omega)     cellLimited Gauss linear 1;
}

// ── Divergence ────────────────────────────────────────────────────────────────
// linearUpwind + cellLimited Gauss linear: bounded second-order for U
// upwind for k, omega: robust and prevents negative values
divSchemes
{
    default                             none;
    div(phi,U)                          Gauss linearUpwindV grad(U);
    div(phi,T)                          Gauss linearUpwind grad(T);
    div(phi,K)                          Gauss linearUpwind grad(K);
    div(phi,k)                          Gauss upwind;
    div(phi,omega)                      Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

// ── Laplacian ─────────────────────────────────────────────────────────────────
// Gauss linear corrected: standard for orthogonal/near-orthogonal meshes
// Use 'limited 0.5' on snappyHexMesh near-wall cells if mesh quality is poor
laplacianSchemes
{
    default         Gauss linear corrected;
}

// ── Interpolation ─────────────────────────────────────────────────────────────
interpolationSchemes
{
    default         linear;
}

// ── Surface normal gradient ───────────────────────────────────────────────────
snGradSchemes
{
    default         corrected;
}

// ── Wall distance ─────────────────────────────────────────────────────────────
// meshWave: efficient for complex geometries from snappyHexMesh
wallDist
{
    method          meshWave;
}

// ************************************************************************* //
