src/IskanderHearth/thermal/openfoam/hearth_t2_thermal/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  Iskander Hearth — Tier 2 Chassis Thermal CFD
  OpenFOAM v2312 | buoyantSimpleFoam | k-omega SST
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    // ── Pressure ─────────────────────────────────────────────────────────────
    // p_rgh: modified pressure (p_rgh = p - rho*g*h). GAMG is fast for pressure.
    p_rgh
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
        maxIter         100;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    // ── Velocity ─────────────────────────────────────────────────────────────
    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
        nSweeps         1;
    }

    // ── Temperature ──────────────────────────────────────────────────────────
    T
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
        nSweeps         1;
    }

    // ── Turbulence (k-omega SST) ──────────────────────────────────────────────
    k
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
    }

    omega
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
    }

    // ── Thermal diffusivity ───────────────────────────────────────────────────
    // alphat is updated algebraically; no linear solver needed
    "(alphat|nut)"
    {
        solver          diagonal;
        tolerance       1e-8;
        relTol          0;
    }
}

// ── SIMPLE algorithm ──────────────────────────────────────────────────────────
// Convergence criterion: residuals < 1e-4 for all fields (Phase 7 requirement)
SIMPLE
{
    nNonOrthogonalCorrectors    1;
    consistent                  yes;  // SIMPLEconsistent: better convergence
    residualControl
    {
        p_rgh       1e-4;
        U           1e-4;
        T           1e-4;
        k           1e-4;
        omega       1e-4;
    }
}

// ── Relaxation factors ────────────────────────────────────────────────────────
// Conservative values for stable buoyant flow convergence.
// Increase U and p_rgh factors (→ 0.8) if convergence is slow on clean meshes.
relaxationFactors
{
    fields
    {
        p_rgh       0.3;
        rho         0.05;  // Density relaxation for buoyancy
    }
    equations
    {
        U           0.5;
        T           0.5;
        k           0.5;
        omega       0.5;
    }
}

// ************************************************************************* //
